### Test Create
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_events_connection.pagerduty_connection will be created
  + resource "awscc_events_connection" "pagerduty_connection" {
      + arn                = (known after apply)
      + auth_parameters    = {
          + api_key_auth_parameters    = {
              + api_key_name  = "Authorization"
              + api_key_value = "my-secret-string"
            }
          + basic_auth_parameters      = (known after apply)
          + invocation_http_parameters = (known after apply)
          + o_auth_parameters          = (known after apply)
        }
      + authorization_type = "API_KEY"
      + description        = (known after apply)
      + id                 = (known after apply)
      + name               = "pagerduty-connection"
      + secret_arn         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_events_connection.pagerduty_connection: Creating...
awscc_events_connection.pagerduty_connection: Creation complete after 6s [id=pagerduty-connection]
```
